CSI API ETABS v1

# cPluginContract Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPluginContract

    Public Interface cPluginContract

    Dim instance As cPluginContract

    public interface class cPluginContract

    type cPluginContract =  interface end

The cPluginContract type exposes the following members.

Methods

| Name| Description
---|---|---
|
Info|  Provides information about
the plugin
|
Main|  The entry point for
launching the plugin
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com